Revit 2016 API
BeamSystem.Direction Property
Retrieves or changes the Direction of the BeamSystem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public XYZ Direction { get; }
Visual Basic
Public ReadOnly Property Direction As XYZ
	Get
Visual C++
public:
property XYZ^ Direction {
	XYZ^ get ();
}
See Also
BeamSystem Class
Autodesk.Revit.DB Namespace